Ran Plan for 2 projects:

1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
1. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
---

### 1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #78. To continue, delete the lock from #78 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 2. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
!       available_maintenance_versions = [
-           "POSTGRES_15_8.R20240910.01_02",
+           "POSTGRES_15_8.R20240910.01_04",
        ]
        id                             = "backstage-dev"
        name                           = "backstage-dev"
        # (13 unchanged attributes hidden)

!       settings {
!           version                      = 89 -> 93
            # (13 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # postgresql_grant.database_connect["backstage_plugin_pagerduty"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_pagerduty"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_pagerduty"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_pagerduty"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_pagerduty"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_pagerduty"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_pagerduty"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-dev"
+       name            = "backstage_plugin_pagerduty"
+       project         = "bits-backstage-dev"
+       self_link       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed